#+TITLE: Stage 1 FACE — 얼굴 확대 turntable → 고해상도 3DGS (relight 쇼케이스)
#+PROPERTY: header-args:jupyter-python :session /jpy:localhost#8888:radiance_face :kernel r3dg

# 가설: 얼굴은 (a) 컴팩트 형상 → 10:1 stretch 실패모드가 구조적으로 약함,
#   (b) 텍스처 풍부 → 몸통과 달리 COLMAP 성공 가능, (c) relight/material PoC 최적 소재.
# 캡처 클래스는 몸통과 동일(배경제거·단일고도·피사체회전) → 정지/중복 꼬리 trim 필요.
# 원칙: 형상(aspect, axis-ratio) 검증, PSNR 아님.

#+begin_src jupyter-python
# 회전 구조 분석 결과 (요약)
# - 비디오: 1280x720, 24fps, 238프레임, ~9.9s. 얼굴 확대, 밝은 회색 균일 배경, 텍스처 풍부.
# - 프레임0 대비 상관(c0): 1.0 -> min 0.445(frame60) -> 100~190 평탄(~0.58, 뒤통수 자기유사) -> 0.975(frame237)
# - 인접프레임 상관 전구간 0.96~0.99: 명확한 정지 꼬리 없음(끝까지 연속 회전). c0 끝 0.975 = 정면 근접 복귀.
# - 결론: ~1회전이나 비대칭/비균일 가능성 -> 균일 azimuth 가정 위험 -> COLMAP으로 실제 포즈 복원 시도.
print('rotation analysis recorded')
#+end_src

#+RESULTS:
: rotation analysis recorded

#+begin_src jupyter-python
# COLMAP 결론 + 방향 전환 (기록)
# attempt1 (80f, exhaustive): 13/80 등록. attempt2 (238f, sequential+loop): 18/238 등록.
# 결정적: 복원 intrinsics degenerate (fx=2601 vs fy=396, distortion 비현실) -> 포즈도 오염.
#   18장 카메라중심 특이값 [16.7, 1.24, 0.38] = 원이 아닌 거의 직선, radius std~mean. 0.65px reproj는 거짓신호.
#   => 배경제거 단일고도 턴테이블 SfM은 얼굴이어도 실패(몸통과 동일).
# 마스크: 회색배경(107,114,119) dist>35 + fill/최대성분 정리 -> 238장 RGBA 깨끗(정면/측면/뒤통수 검증).
# 회전구조 확정(시각): f0정면 -> f120정확히 뒤통수(180) -> f237정면 = 균일 1회전. azimuth=i*360/238.
# 방향전환: COLMAP 버리고 analytic 원형 포즈(radius3, elev0, fov40, sign+1) + 전체238f -> 3DGS.
#   얼굴 컴팩트 -> 10:1 stretch 구조적으로 불가. 검증: 머리 aspect~1 기대(PSNR 아님).
print('colmap dead-end recorded; pivoted to analytic poses + 3DGS geometry test')
#+end_src

#+RESULTS:
: colmap dead-end recorded; pivoted to analytic poses + 3DGS geometry test
